tests/fixtures/mod_invoice.xml

<?xml version="1.0" encoding="UTF-8" ?>
<dataset>
    <client id="1" aid="1" role="client" email="client@boxbilling.com" pass="89e495e7941cf9e40e6980d14a16bf023ccd4c91" tax_exempt="0" status="active" first_name="Demo" last_name="Client" phone_cc="1" phone="646-123-4567" company="BoxBilling" address_1="Wall Street 45" city="New York" state="NY" country="US" currency="USD" postcode="123456" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>

    <invoice id="1" client_id="1" hash="hash" currency="USD" status="unpaid" due_at="2014-01-01 12:00:00" created_at="2011-11-01 12:00:00" updated_at="2011-11-01 12:00:00"/>
    <invoice_item id="1" invoice_id="1" type="custom" task="void" status='pending_payment' title="Payment for development services" period="" quantity="10" unit="hours" price="50" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>

    <invoice id="2" client_id="1" hash="hash2" currency="USD" status="unpaid" approved="1" due_at="2014-01-01 12:00:00" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <invoice_item id="2" invoice_id="2" type="order" rel_id="3" status='pending_payment' task="activate" title="Payment for domain example.com" period="1Y" quantity="1" unit="years" price="8.99" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>

    <invoice id="3" client_id="1" hash="hash3" currency="USD" status="paid" due_at="2014-01-01 12:00:00" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <invoice_item id="3" invoice_id="3" type="custom" rel_id="" status='pending_setup' task="activate" title="Payment for custom product" period="1Y" quantity="1" unit="years" price="8.99" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    
    <invoice id="4" client_id="1" hash="hash4" currency="USD" status="paid" due_at="2014-01-01 12:00:00" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <invoice_item id="4" invoice_id="4" type="custom" rel_id="" status='pending_setup' task="activate" title="Payment for custom product" period="1Y" quantity="1" unit="years" price="8.99" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>

    <setting id="9" param="company_email" value="boxbilling@boxbilling.com" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <setting id="10" param="theme" value="huraga" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>

    <transaction />
    <transaction id="10" invoice_id="1" txn_id="321499792P233823Y"  gateway_id="2" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00" ipn='{"get":{"bb_gateway_id":"4","bb_invoice_id":"2"},"post":{"transaction_subject":"Payment for invoice 02 [BoxBilling Pro License]","txn_type":"web_accept","payment_date":"10:50:58 Sep 09, 2012 PDT","last_name":"Doe","residence_country":"US","item_name":"Payment for invoice 02 [BoxBilling Pro License]","payment_gross":"17.85","mc_currency":"USD","business":"sales@boxbilling.com","payment_type":"echeck","protection_eligibility":"Ineligible","verify_sign":"AWV-DF.sxuuqGRHykbk8E7.C7EVoAIgJEU6Ry9yF5RV6hZcgx4j6QIUJ","payer_status":"verified","tax":"0.00","payer_email":"john.doe@gmail.com","txn_id":"321499792P233823Y","quantity":"1","receiver_email":"sales@boxbilling.com","first_name":"John","payer_id":"D83FZCL7G529J","receiver_id":"YAU6UPNDCYP5E","item_number":"2","handling_amount":"0.00","payment_status":"Completed","shipping":"0.00","mc_gross":"17.85","custom":"","charset":"windows-1252","notify_version":"3.6","ipn_track_id":"2131e6325918f"}}'/>

</dataset>